[
    "Q: When do you go at red and stop at green? A: When you’re eating a watermelon.",
    "Q: What do you call cheese that is sad? A: Blue cheese.",
    "What do you call blueberries playing the guitar? A jam session.",
    "Q: Did you hear about the carrot detective? A: He got to the root of every case.",
    "What do you get if you cross an apple with a shellfish? A crab apple!",
    "Did you see the movie about the hot dog? It was an Oscar wiener.",
    "Q. What’s the difference between a shamrock and a bread knife that gets used a lot? A. The shamrock is a four-leaf clover, and the knife is a four-loaf cleaver.",
    "Q. What did the hot dog say when his friend passed him in the race? A. Wow, I relish the fact that you’ve mustard the strength to ketchup to me.",
    "Q. Which thrill ride does a wine glass love to go on the most? A. A coaster! (Credit: justbadpuns.com)",
    "Q. What do you call a grilled cheese sandwich that gets right up in your face? A. Too close for comfort food.",
    "Did you hear the one about the guy who invented Tic Tacs? They say he made a mint.",
    "Q. Which type of vegetable tries to be cool, but is only partly successful at it? A. The radish.",
    "I can’t stand potato puns. I think they’re pomme de terrible.",
    "Q. What do you call a round, green vegetable that breaks out of prison? A. An escapea.",
    "Q. Why does yogurt love going to museums? A. Because it’s cultured.",
    "Q. What do you call a fake noodle? A. An impasta.",
    "Person 1: I just burned 2000 calories in 20 minutes. Person 2: How?! Person 1: I forgot to take my brownies out of the oven.",
    "SPOILER ALERT: That milk has been in the fridge for three weeks.",
    "Q: Why did the dieter go to the paint store? A: He wanted to get thinner.",
    "Q: Why do watermelons have fancy weddings? A: Because they cantaloupe.",
    "What does a grape say when it gets stepped on? Nothing, it just lets out a little wine.",
    "Did you hear about the Italian chef with a terminal illness? He pastaway.",
    "Boy, I just got hit in the head with a can of soda. I was lucky it was a soft drink.",
    "Q: What do you get when you play Tug-of-War with a pig? A: Pulled-Pork.",
    "I went to a seafood restaurant and slipped. I pulled a mussel.",
    "It was an emotional wedding. Even the cake was in tiers.",
    "Q: What do you call the king of vegetables? A: Elvis Parsley.",
    "You know what’s hard to beat for breakfast? A boiled egg.",
    "Spending a lot of time at the coffee bar can cause a latte problems.",
    "Did you see the movie about the hot dog? It was an Oscar Wiener.",
    "A guy just threw a glass of milk at me. How dairy!",
    "I was going to grow an herb garden, but I couldn’t find the thyme.",
    "The majority of Americans find bananas a peeling.",
    "The price of candy at the movie theater is ridiculous. They’re always raisinet!",
    "Every morning I think I’m going to make pancakes, but I keep waffling.",
    "I love when candy canes are in mint condition.",
    "Becoming a vegetarian was a huge missed steak.",
    "Q: What are hot dogs called in winter? A: Chilly dogs",
    "A man told a friend about taking his wife to dinner for their anniversary. He described how the food was made in front of them. The friend said, “I’ve heard of places like that, what is the name of the restaurant?” The man replied, “Subway.”",
    "Q. What’s the difference between a jeweler and a prison guard? A. A jeweler sells watches, and a prison guard watches cells!",
    "Q. Name the next letter in this sequence: J F M A M J J A S O N ? A. D. The sequence contains the first letter of every month, in order.",
    "Q. How do you make the number one disappear? A. Add the letter G and then presto—it’s Gone!",
    "Q. I’m an odd number. If you take away one of the letters in my name, I become even. What number am I? A. Seven. (Take away the S!)",
    "Q. A girl fell off of a 30-foot ladder, but she didn’t get hurt at all. How is this possible? A. She fell off the bottom step!",
    "Q. There are three apples on a table and you take away two of them. How many apples do you have now? A. Two, of course!",
    "Q. Can you name three consecutive days without using the words “Wednesday,” “Friday,” or “Sunday”? A. Yesterday, today, and tomorrow.",
    "Q. There’s a one-story house where everything inside is pink: pink walls, pink doors, pink floors, pink ceilings, pink windows, pink curtains, pink chairs, and pink tables. What color are the stairs? A. There are none—it’s a one-story house!",
    "Q. One (k)night, a king and a queen went into a castle. There was no one in the castle when they went in, and no one else entered the castle while they were there. The next day, three people came out of the castle. Who were they? A. The king, the queen, and the knight!",
    "Q. How many cats can you put in an empty box? A. One. After that, the box isn’t empty anymore.",
    "Q. What starts with “e,” ends with “e,” and contains one letter? A. An envelope.",
    "Q. What has one head, one foot, and four legs? A. A bed.",
    "Q: What do you call an Amish guy with his hand in a horse’s mouth? A: A mechanic.",
    "A: I hear invoices! Stephen Pickering, Marshall, Michigan",
    "Q: How far can a fox run into a grove? A: Only halfway—then he’s running out of it!",
    "Q: I travel all over the world, but always stay in my corner. What am I? A: A stamp.",
    "Q: With pointed fangs I sit and wait; with piercing force I crunch out fate; grabbing victims, proclaiming might; physically joining with a single bite. What am I? A: A stapler",
    "Q: What kind of coat is always wet when you put it on? A: A coat of paint.",
    "Q: How many seconds are there in one year? A: 12 of them: January 2nd, February 2nd, March 2nd, April 2nd, May 2nd, June 2nd, July 2nd, August 2nd, September 2nd, October 2nd, November 2nd, December 2nd.",
    "Q: What has 13 hearts, but no other organs? A: A deck of playing cards.",
    "Q: How many bananas can you eat if your stomach is empty? A: Just one—after that, it’s not empty anymore.",
    "Q: What do you call a bear without an ear? A: A “b”.",
    "Q: Why was the chef embarrassed? A: Because he saw the salad dressing!",
    "Q: Where is the ocean the deepest? A: On the bottom!",
    "Q: What do you break before you use it? A: An egg!",
    "Q: A man rode in to town on Tuesday, and left two days later on Tuesday. How so? A: His horse is named Tuesday!",
    "Q: Why is the letter A the most like a flower? A: Because the B is after it.",
    "Q: What are two things you wouldn’t eat after waking up? A: Lunch and dinner.",
    "Q: Why did the boy throw a bucket out the window? A: He wanted to see the waterfall. Q: Why did the boy throw butter out the window? A: He wanted to see the butterfly. Q: Why did the boy throw his watch out the window? A: He wanted to see time fly.",
    "Q: Which is the most curious letter? A: Y?",
    "Q: What did zero say to eight? A: Nice belt.",
    "Q: What do pandas have that no other animal has? A: Baby pandas!",
    "Q: Why can’t someone living in Maine be buried in Florida? A: Because he’s still living!",
    "Q: Which month has 28 days? A: All of them, silly!",
    "Q: What starts with a P, ends with an E, and has thousands of letters? A: The Post Office!",
    "Q: What kind of cheese is made backwards? A: Edam.",
    "Q: What word begins and ends with an E, but only has one letter? A: Envelope!",
    "Q: What five-letter word becomes shorter when you add two letters to it? A: Short!",
    "Some people just have a way with words, and other people … oh … not have way. Steve Martin",
    "I bought one of those tapes to teach you Spanish in your sleep. During the night, the tape skipped. Now I can only stutter in Spanish. Steven Wright",
    "The closest a person ever comes to perfection is when he fills out a job application form. Businessman Stanley Randall",
    "You’ll never be as lazy as whoever named the fireplace. @longwall26",
    "We’ve begun to long for the pitter-patter of little feet, so we bought a dog. It’s cheaper, and you get more feet. Rita Rudner",
    "Nature abhors a vacuum, but not as much as a cat does. anonymous",
    "We need a 12-step group for compulsive talkers. They could call it On Anon Anon. Paula Poundstone",
    "Does it disturb anyone else that “The Los Angeles Angels” baseball team translates directly to “The The Angels Angels”? Neil DeGrasse Tyson",
    "I don’t know that there are real ghosts and goblins, but there are always more trick-or-treaters than neighborhood kids. —Robert Brault",
    "Halloween is the beginning of the holiday shopping season. That’s for women. The beginning of the holiday shopping season for men is Christmas Eve. —David Letterman",
    "My parents didn’t want to move to Florida, but they turned 60 and that’s the law. —Jerry Seinfeld",
    "There’s no “I” in denial. Peter Serafinowicz",
    "How come you never see a headline like “Psychic Wins Lottery”? Jay Leno",
    "If con is the opposite of pro, then isn’t Congress the opposite of progress? Jon Stewart",
    "What are they planting to grow the seedless watermelon? Jerry Seinfeld",
    "Try an internship! Internships give you all the experience of a summer job without the hassle of a paycheck. Stephen Colbert",
    "Sometimes I think war is God’s way of teaching us geography. Comedian Paul Rodriguez",
    "You know it’s time to do the laundry when you dry off with a sneaker. Zach Galifianakis",
    "Every novel is a mystery novel if you never finish it. @meganamram",
    "I got my hair highlighted because I thought some strands were more important than others. Comedian Mitch Hedberg",
    "Q: When do you go at red and stop at green? A: When you’re eating a watermelon.",
    "Q: What do you call cheese that is sad? A: Blue cheese.",
    "What do you call blueberries playing the guitar? A jam session.",
    "Q: Did you hear about the carrot detective? A: He got to the root of every case.",
    "What do you get if you cross an apple with a shellfish? A crab apple!",
    "Did you see the movie about the hot dog? It was an Oscar wiener.",
    "Q. What’s the difference between a shamrock and a bread knife that gets used a lot? A. The shamrock is a four-leaf clover, and the knife is a four-loaf cleaver.",
    "Q. What did the hot dog say when his friend passed him in the race? A. Wow, I relish the fact that you’ve mustard the strength to ketchup to me.",
    "Q. Which thrill ride does a wine glass love to go on the most? A. A coaster! (Credit: justbadpuns.com)",
    "Q. What do you call a grilled cheese sandwich that gets right up in your face? A. Too close for comfort food.",
    "Did you hear the one about the guy who invented Tic Tacs? They say he made a mint.",
    "Q. Which type of vegetable tries to be cool, but is only partly successful at it? A. The radish.",
    "I can’t stand potato puns. I think they’re pomme de terrible.",
    "Q. What do you call a round, green vegetable that breaks out of prison? A. An escapea.",
    "Q. Why does yogurt love going to museums? A. Because it’s cultured.",
    "Q. What do you call a fake noodle? A. An impasta.",
    "Person 1: I just burned 2000 calories in 20 minutes. Person 2: How?! Person 1: I forgot to take my brownies out of the oven.",
    "SPOILER ALERT: That milk has been in the fridge for three weeks.",
    "Q: Why did the dieter go to the paint store? A: He wanted to get thinner.",
    "Q: Why do watermelons have fancy weddings? A: Because they cantaloupe.",
    "What does a grape say when it gets stepped on? Nothing, it just lets out a little wine.",
    "Did you hear about the Italian chef with a terminal illness? He pastaway.",
    "Boy, I just got hit in the head with a can of soda. I was lucky it was a soft drink.",
    "Q: What do you get when you play Tug-of-War with a pig? A: Pulled-Pork.",
    "I went to a seafood restaurant and slipped. I pulled a mussel.",
    "It was an emotional wedding. Even the cake was in tiers.",
    "Q: What do you call the king of vegetables? A: Elvis Parsley.",
    "You know what’s hard to beat for breakfast? A boiled egg.",
    "Spending a lot of time at the coffee bar can cause a latte problems.",
    "Did you see the movie about the hot dog? It was an Oscar Wiener.",
    "A guy just threw a glass of milk at me. How dairy!",
    "I was going to grow an herb garden, but I couldn’t find the thyme.",
    "The majority of Americans find bananas a peeling.",
    "The price of candy at the movie theater is ridiculous. They’re always raisinet!",
    "Every morning I think I’m going to make pancakes, but I keep waffling.",
    "I love when candy canes are in mint condition.",
    "Becoming a vegetarian was a huge missed steak.",
    "Q: What are hot dogs called in winter? A: Chilly dogs",
    "A man told a friend about taking his wife to dinner for their anniversary. He described how the food was made in front of them. The friend said, “I’ve heard of places like that, what is the name of the restaurant?” The man replied, “Subway.”",
    "When my baby granddaughter LeeAnn came home from the hospital, the aunts, uncles and cousins were there to greet her. I showed her cousin Alex the baby and told him, “This is Grandma’s girl.” Alex replied, “You are not her grandma; she doesn’t even know you.”",
    "My 3-year-old granddaughter, Sydney, told my husband, Ted, and me that she was going fishing with her dad. Ted asked if she was going to use worms. “No,” she said. “I’m going to use a fishing pole.”",
    "A young man was planting some flower seeds on a sweltering day, sweating from the hot sun. His neighbor said, “You need to wait until the sun goes down, or plant in the morning when it is coolest.” The man said, “I can’t do that. It says on the package, ‘Plant in full sun!’ ”",
    "When weeding your garden, there’s an easy way to tell the difference between a weed and a vegetable or flower. Pull on it, and if it doesn’t come up, it’s a weed. But if it comes out easily, it’s not.",
    "While carrying 3-year-old Matthew up the stairs, I told him, “Just think, when you get older you can carry me up the stairs.” He thought about this and then, with a worried look, he asked, “Will you be any smaller?”",
    "My 3-year-old grandson, Cruise, has always been impressed with Grandpa’s mighty machines, which include a tractor, an ATV and a snowmobile. One day his mom said to him, “Let’s go to Grandma’s to use her sewing machine.” He quickly responded, “Can I ride it?”",
    "Girl on skates. The ice was thin. Then it broke and she fell right in. Boy on bank heard her shout. Jumped right in and helped her out. Now they’re married. Very nice. But first she had to break the ice.",
    "When my granddaughter Keilei was 8, she asked me, “Grandma, does God answer prayers?” “Yes, he does,” I replied. Then she asked, “Will he give you whatever you ask for?” Again, I replied yes. Then Keilei lifted her arms and yelled, “Thank you, Jesus! Grandma’s getting me a dog!”",
    "My nephew asked, “Why does Nana have so many Bibles?” I said, “She’s studying for finals.”",
    "We were sitting at the table for a meal and my wife and sister were discussing recipes. When a dump cake was suggested, my 4-year-old daughter, Hannah, announced, “Yuck! That has trash in it!”",
    "When my grandson, Jimmy, was 4 or 5, we asked him what he wanted to be when he grew up. “I want to be a machine,” he said without hesitation. When we asked him why, he explained, “Well, you can replace the parts in a machine when they wear out.”",
    "One night when my son Patrick was 2 years old, he looked up at a half moon and said, “Moon broken.” The next time there was  a full moon in the sky, he looked up and said, “Moon fixed now.”",
    "Several years ago, our grandson Andrew slept at our house overnight. For breakfast I made pancakes, and I gave him one that was browner than the others. He told me he didn’t want that one because it was too ripe.",
    "My great-granddaughter Brylee was playing horse with her pappy one night. As she was sitting on his back, he asked her how old she was. Brylee said, “Pappy, you know I’m 3.” “When will you be 4?” he asked. “When I get through being 3,” she explained.",
    "When my daughter Mandy was 31/2, we went to visit my grandma in the nursing home. Mandy was trying to talk to a wheelchair-bound resident but was getting little response from her. So she decided to end the conversation by looking down at the wheelchair and exclaiming, “Nice wheels!”",
    "Recently my wife and I were watching our grandsons, ages 3 and 4. The older boy, Owen, fell while he was playing and said, “I hurt my toe.” When I asked him which toe, he hesitated for a few seconds before replying, “the one that goes to market.”",
    "Q. What’s the difference between a jeweler and a prison guard? A. A jeweler sells watches, and a prison guard watches cells!",
    "Q: What do chemists’ dogs do with their bones? A: They barium!",
    "Q: What did the cat say when the mouse got away? A: You’ve got to be kitten me!",
    "Q: Why don’t cats play poker in the jungle? A: There are too many cheetahs.",
    "Q: How does a hurricane see? A: With its eye.",
    "Q: Why should you stand in the corner if you get cold? A: It’s always 90 degrees.",
    "Q. What did the ocean say to the sailboat? A. Nothing, it just waved.",
    "Q. Where do shellfish go to borrow money? A. The prawn broker.",
    "Q. What do you call a snowman in July? A. A puddle.",
    "Q. What lies at the bottom of the ocean and twitches? A. A nervous wreck.",
    "Q. What does a dolphin say when he’s confused? A. Can you please be more Pacific?",
    "Q: Can Bees fly in the rain? A: Not without their yellow jackets.",
    "Q: What is a Queens favorite kind of precipitation? A: Reign!",
    "Q: What is the Mexican weather report? A: Chili today and hot tamale.",
    "Q: What did the evaporating raindrop say? A: I’m going to pieces.",
    "Q: What did the hail storm say to the roof? A: Hang onto your shingles, this will be no ordinary sprinkles.",
    "Q: What do you call a wet bear? A: A drizzly bear",
    "Q: What do you call two straight days of rain in Seattle? A: A weekend.",
    "Q: What goes up when the rain comes down? A: An Umbrella.",
    "Q: What does it do before it rains candy? A: It sprinkles!",
    "Q: Why did the man use ketchup in the rain? A: Because it was raining cats and hot dogs",
    "Q: What did one raindrop say to the other? A: Two’s company, three’s a cloud",
    "Q: Why does Snoop dog need an umbrella? A: Fo’ Drizzle.",
    "Q: What’s the difference between a horse and the weather? A: One is reined up and the other rains down.",
    "Q: When does it rain money? A: When there is “change” in the weather.",
    "Q: What is a king’s favorite kind of precipitation? A: Hail!",
    "What kind of music are balloons afraid of? Pop Music",
    "What is the musical part of a snake? The scales.",
    "What did Beethoven say to Johann Sebastian when he was helping him parallel park? “Bach it up.”",
    "Where did the music teacher leave her keys? In the piano.",
    "Me and my friends are in a band called “Duvet”. We’re a cover band.",
    "Which composer likes tea the most? Chai-kovsky.",
    "How did the turkey win the talent show? With his drum-sticks.",
    "C, E-flat, and G walk into a bar. The bartender shows them the door and says, “Sorry, we don’t serve minors.”",
    "What’s an avocado’s favorite music? Guac ‘n’ roll.",
    "What do you get when you drop a piano down a mineshaft? A-flat minor.",
    "What do you call a cow that can play a musical instrument? A moo-sician.",
    "What do you call a musician with problems? A trebled man.",
    "What was Beethoven’s favorite fruit? BA-NA-NA-NAAAAAA.",
    "What did Jay-Z call his wife before they got married? Feyonce."
]